// pages/diease/dadou.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    data_diease: [{
      diease: "大豆",
      diease_name: '红蜘蛛',
      diease_img: "../../images/plant/dadouhongzhizhu.jpg",
      diease_bingyin: '成虫体长0.3-0.5毫米，红褐色，有4对足。雌螨体长0.5毫米，卵圆形或梨形，前端稍宽隆起，尾部稍尖，体背刚毛细长，体背两侧各有1块黑色长斑；越冬雌虫朱红色有光泽。雄虫体长0.3毫米，紫红至浅黄色，纺锤形或梨型。卵直径0.13毫米，圆球形，初产时无色透明，逐渐变为黄带红色。幼螨足3对，体圆形，黄白色，取食后卵圆形浅绿色，体背两侧出现深绿长斑。若螨足4对，淡绿至浅橙黄色，体背出现刚毛。',
      diease_zhengzhuang: ' 大豆红蜘蛛在大豆整个生育期均可发生，初为点片发生，以成螨和若螨群集于叶背面结丝成网，刺吸叶汁。大豆叶片受害初期叶正面出现黄白色斑点，3-5天后斑点扩大加密，叶片出现红褐色斑，局部甚至全部卷缩，枯焦变黄或红褐色，落叶甚至光秆，严重时整株死亡。施氮肥多的地块发生重。食物缺乏时，有迁移的习性，7-8月份为害高峰，杂草多或植株稀疏长势差的地块发生较重。',
      diease_fangan: '①农业防治：施足底肥，增加磷钾肥，后期不脱肥，及时除净杂草，干旱及时灌水，有条件的进行水旱轮作，能减轻发病。②化学防治：点片发生、大豆卷叶株率10%时应立即用药防治，可结合防治蚜虫选用73%灭螨净3000倍液或40%二氯杀螨醇1000倍液或25%克螨特乳油3000倍液或20%扫螨净、螨克乳油2000倍液等喷雾，连喷2-3次。干旱条件下加喷液量 1%植物型喷雾助剂药笑宝、信得宝等。③生物药剂防治：有机大豆可选用1.8%阿维菌素乳油、0.3%印楝素乳油1500-2000倍液，或10%浏阳霉素乳油1000-1500倍液、2.5%华光霉素400-600倍液、仿生农药1.8%农克螨乳油2000倍液喷雾，干旱条件下加喷液量1%植物型喷雾助剂药笑宝、信得宝等。'
    },
      {
        diease: "大豆",
        diease_name: '病毒病',
        diease_img: "../../images/plant/dadoubingdubing.jpg",
        diease_bingyin: '南方春大豆病毒病的病原有3种：①大豆花叶病毒(SMV),SMV侵染大豆后引起大豆花叶症状。②黄瓜花叶病毒(CMV),CMV引起大豆萎缩症状和豆粒轮纹状。③苜蓿花叶病毒(AMV),AMV引起大豆叶片花叶症状，其特点是鲜明的黄色斑纹。引起大豆病毒病的3种病毒往往同时侵染大豆，田间所表现的症状往往不是单一症状，而是混合症状。这些病毒北方也有，不多见。',
        diease_zhengzhuang: ' 春大豆发病后，先是上部叶片出现淡黄绿相间的斑驳，叶肉沿着叶脉呈泡状凸起，接着斑驳皱缩越来越重，叶片畸形，叶肉突起，叶缘下卷，植株生长明显矮化，结荚数减少，荚细小，豆荚呈扁平、弯曲等畸形症状。发病春大豆成熟后，豆粒明显减小，并可引起豆粒出现浅褐色斑纹。',
        diease_fangan: '1. 选用抗病品种，建立无病留种田， 选用无褐斑、饱满的豆粒作种子。2. 加强肥水管理，培育健壮植株，增强抗病能力。3. 及早防治蚜虫，从小苗期开始就要进行蚜虫的防治，防止和减少病毒的侵染。4. 使用化学药剂防治 。 春大豆病毒病应从苗期开始，这样才能提高防效。可结合苗期蚜虫的防治施药。药剂可选用20% 病毒A500倍液或1.5% 植病灵乳油1000倍液，或者5% 菌毒清400倍液，连续使用2~3次，隔10天1次.'
      }, {
        diease: "大豆",
        diease_name: '细菌病',
        diease_img: "../../images/plant/dadouxijunbing.jpg",
        diease_bingyin: '大豆细菌性叶部病害主要有两种1：大豆细菌性叶斑病 （英文名：bacterial blight) ，病原菌拉丁学名：Pseudomonas syringae pv.glycinea(Coerper) Young, Dye & Wilkie2：细菌性角斑病腐(英文名：bacterial pustule) ， 病原菌拉丁学名，Xanthomonas campestris pv．phascoli(Smith) Dye为害作物：大豆分布区域：大豆细菌性叶斑病（bacterial blight) 喜低温，主要分布在北方大豆产区； 细菌性角斑病腐(bacterial pustule) 喜高温，主要分布在南方大豆产区。',
        diease_zhengzhuang: ' 大豆细菌性叶部病害有两种。用肉眼不易识别。两种是：1）细菌性斑点病， 2）细菌性斑疹病。 细菌性斑点病最初在叶片上形成水渍状斑点，以后变成褐色或黑色多角形斑，边缘有黄绿色晕圈。病组织易枯死脱落，病叶呈破碎状。茎及叶柄受病产生黑褐色条斑。荚受病产生红褐色小点，后成为不规则形小斑，多集中于豆荚合缝处。病菌在种子上形成褐色斑点，上有一层菌脓。细菌性斑疹病症状与斑点病相似，主要区别在：斑疹病斑点小而密，初期不呈水渍状，边缘的晕圈不明显，斑的中央有凸起的小疹，严重时叶上许多病斑相互汇合后大片组织枯死。',
        diease_fangan: '(1)选用无病种子。          (2)与禾本科作物及棉、麻、薯类等作物轮作，收获后及时深翻，促使病残体加速腐烂。(3)种子处理用l克兽用链霉素加水5 - 10公斤浸种30 - 60分钟，也可用 50 % 福美双可湿性粉剂拌种，100公斤种子用0.3公斤药。 '
      },
      {
        diease: "大豆",
        diease_name: '霜霉病',
        diease_img: "../../images/plant/dadoushuangmeibing.jpg",
        diease_bingyin: '由霜霉菌侵染大豆地上部引起的真菌病害。病苗子叶无症，第一对真叶从基部开始出现褪绿斑块，沿主脉及支脉蔓延，直至全叶褪绿。以后全株各叶片均出现症状。花期前后气候潮湿时，病斑背面密生灰色霉层，最后病叶变黄转褐而枯死。叶片受再侵染时，形成褪绿小斑点，以后变成褐色小点，背面产生霉层。受害重的叶片干枯，早期脱落。豆荚被害，外部无明显症状，但荚内有很厚的黄色霉层，为病菌的卵孢子。被害籽粒色白而无光泽，表面附有一层黄白色粉末状卵孢子。',
        diease_zhengzhuang: ' 病原物为霜霉菌(Peronospora man-schurica (Naum.) Syd.)属卵菌,霜霉目, 卵孢子球状、黄褐色、厚壁,表面光滑或有突起物。孢囊梗二叉状分枝、末端尖锐,顶生一个孢子囊、无色, 椭圆形或卵形。病菌除为害大豆外,还为害野大豆。病菌有生理分化现象, 美国鉴定出32个生理小种, 中国已鉴定出3个小种。最适发病温度为20～22℃,10℃以下或30℃以上不能形成孢子囊,15～20℃为卵孢子形成的最适温度。湿度也是重要的发病条件,7月至8月多雨高湿易引发病害,干旱、低湿、少露则不利病害发生。',
        diease_fangan: '大豆霜霉病的防治措施主要有: ①选育抗病品种: 根据各地病菌的优势小种选育和推广抗病良种,如吉林的早丰5号和白花锉等。②种子处理:用瑞毒霉拌种, 或以克霉灵、福美双及敌克松为拌种剂, 效果很好。③清除病苗: 病苗症状明显、易于识别, 铲地时可结合除去病苗,消减初侵染源。④喷洒药剂: 病害流行条件出现时, 及早用百菌清、多菌灵、退菌特等喷施防治。 '
      },
      {
        diease: "大豆",
        diease_name: '菌核病',
        diease_img: "../../images/plant/dadoujunhebing.jpg",
        diease_bingyin: 'Sclerotinia sclerotiorum（Lib．）de Bary 称核盘菌，属子囊菌亚门真菌。菌核圆柱状或鼠粪状，大小3～7×1～4（μm），内部白色，外部黑色。子囊盘盘状，上生栅状排列的子囊。子囊棒状，内含8个子囊孢子。子囊孢子单胞，无色，椭圆形，大小9～14×3～6（μm）。侧丝无色，丝状，夹生在子囊间。菌丝在5～30℃均可生长，适温20～25℃。菌核萌发温限5～25℃，适温20℃。菌核萌发不需光照，但形成子囊盘柄需散射光才能膨大形成子囊盘。在马铃薯蔗糖琼脂培养基上菌丛白色，生长迅速，不久形成黑色鼠粪状菌核。菌核在多雨、潮湿并有光照条件下，才能萌发形成子囊盘，子囊盘呈盘状；子囊内含8个子囊孢子，子囊孢子单孢，无色，椭圆形，9~14×3~6微米。',
        diease_zhengzhuang: ' 七月下旬开始发病，主要为害地上部，苗期、成株均可发病，花期受害重，产生苗枯、叶腐、茎腐、荚腐等症。苗期染病茎基部褐变，呈水渍状，湿度大时长出棉絮状白色菌丝，后病部干缩呈黄褐色枯死，表皮撕裂状。叶片染病始于植株下部，初叶面生暗绿色水浸状斑，后扩展为圆形至不规则形，病斑中心灰褐色，四周暗褐色，外有黄色晕圈；湿度大时亦生白色菌丝，叶片腐烂脱落。茎秆染病多从主茎中下部分权处开始，病部水浸状，后褪为浅褐色至近白色，病斑形状不规则，常环绕茎部向上、下扩展，致病部以上枯死或倒折。湿度大时在菌丝处形成黑色菌核。病茎髓部变空，菌核充塞其中。干燥条件下茎皮纵向撕裂，维管束外露似乱麻，严重的全株枯死，颗粒不收。豆荚染病现水浸状不规则病斑，荚内、外均可形成较茎内菌核稍小的菌核，多不能结实。',
        diease_fangan: '（1）加强长期和短期测报以正确估计本年度发病程度，并据此确定合理种植结构。（2）实行与非寄主作物三年以上的轮作。菌核在非寄主轮作的生长季也可以萌发，无效侵染而死。（3）选用优良品种在无病田留种，选用无病种子播种，或选用株型紧凑、尖叶或叶片上举、通风透光性能好的耐病品种。如合丰26、黑河7号、九丰3号、内豆1号等。种子在播种前要过筛，清除混在种子中的菌核。（4）及时排水，降低豆田湿度，避免施氮肥过多，收获后清除病残体。发生严重地块后，豆秆要就地烧毁，实行秋季深翻，使遗留在土壤表层的菌核、病株残体埋入土下腐烂死亡。（5）发病初期开始喷洒40% 多· 硫悬浮剂600～700倍液或70 % 甲基硫菌灵可湿性粉剂500～600倍液、50% 混杀硫悬浮剂600倍液、80% 多菌灵可湿性粉剂600～700倍液、50% 扑海因可湿性粉剂1000～1500倍液、12.5% 治萎灵水剂500倍液、40% 治萎灵粉剂1000倍液、50% 复方菌核净1000倍液，此外，每667平方米施用真菌王肥200ml与50% 防霉宝（多菌灵盐酸盐）600g，对水60L于初花末期或发病初期喷洒，防效优异。 或选择50% 速克灵可湿性粉剂每公顷用药量1500克，对水喷雾；40% 纹枯利可湿性粉剂800 - 1200倍液。50% 农利灵可湿性粉剂每公顷用药量1500克，对水喷雾；25% 施保克乳油，每公顷1050毫升，对水喷雾。一般于发病初期防治一次，7~10天后再喷一次，但一定要喷得均匀周到，才能得较好效果。 '
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})