// pages/diease/lajiao.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    data_diease: [{
      diease: "辣椒",
      diease_name: '疮痂病',
      diease_img: "../../images/plant/lajiaochuangjiabing.jpg",
      diease_bingyin: 'Xanthomonas campestris pv．Vesicatoria称野油菜黄单胞辣椒斑点病致病型。属细菌，菌体杆状，两端钝圆，具极生单鞭毛，能游动。菌体排列链状，有荚膜，革兰氏阴性，好气。病原细菌主要在种子表面越冬，也可随病残体在田间越冬。旺长期易发生，病菌从叶片上的气孔侵入，潜育期3～5天；在潮湿情况下，病斑上产生的灰白色菌脓借雨水飞溅及昆虫作近距离传播。发病适温27～30℃，高温高湿条件时病害发生严重，多发生于7～8月份，尤其在暴风雨过后，容易形成发病高峰。高湿持续时间长，叶面结露对该病发生和流行至关重要。',
      diease_zhengzhuang: ' 病害发生在幼苗、叶片、茎秆和果实等部位，尤其是叶片上发生普遍。幼苗发病，子叶上生水渍状银白色小斑点，逐渐变为淡黑色凹陷病斑；成株期病叶上初为水渍状黄绿色小斑点，扩大后为不规则形，边缘暗褐色，稍突起，中部颜色较淡，稍凹陷，表面粗糙，像疮痂。常几个病斑连在一起呈不规则大斑。受害重的叶片，叶缘、叶尖变干枯、破裂，最后脱落。如病斑沿叶脉发生时，常造成叶片畸形。　茎秆或者是果柄上发病，开始为水渍状不规则条斑，以后变成暗褐色，突起，纵裂，呈疮痂状。 果实被害，最初为黑色或暗褐色隆起的小点，或者呈疱疹状。病斑边缘水渍状，稍隆起。病斑为圆形或长圆形黑褐色疮痂状。有的病斑边缘有裂口，潮湿时，中间会溢出菌脓。',
      diease_fangan: '1.种子处理。可采用55℃温汤浸种10分钟或农用链霉素、新植霉素1000倍浸种30分钟，亦可用1%硫酸铜浸种5分钟，水洗后催芽。此外，也可用1‰高锰酸钾浸种15分钟，但必须洗净再催芽。2.轮作。与辣椒、甜椒、番茄以外的寄主实行2～3年轮作。 3.加强管理。辣椒定植后，要及时松土、追肥，促进根系发育。在温室栽培中特别要注意通风、降温、排湿。 4.药剂防治。可选用以下药剂防治：1: 1: 200倍的波尔多液，链霉素或新植霉素4000倍，60% 琥乙磷铝（DTM）可湿性粉500倍液，77% 可杀得（氢氧化铜）可湿性粉400～500倍喷雾。以上药剂任选一种，交替用药，每隔7～10天喷一次，视病情连喷2～3次。 5.病株、病叶、病果要及时收集带到田外集中销毁。'
    }]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})