// pages/diease/tao.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    data_diease: [{
      diease: "桃",
      diease_name: '疮痂病',
      diease_bingyin: '  疮痂病又称黑星病，属真菌性病害，主要危害桃树的果实，有的地方也危害到桃树的新梢和叶片。早熟品种因为生育期较短危害程度较轻，中、晚熟品种危害较重。 疮痂病的病菌多以菌丝体在受病的树枝上越冬，次年借助风雨迅速传播，当气温在20℃~28℃、遇到潮湿多雨的天气时，最易流行扩散，一般6月开始发病，7~8月为发病盛期，病菌在幼果上潜伏期可达40~70天，在嫩梢上的潜伏期为25~45天。南方地区气温回暖快，发病高峰会相应提前，特别是密度大、荫蔽严重、排水不良的桃园，更易成为发病的重灾区。因此，在防治上，要区别情况，因地制宜，分期及早加以预防。',
      diease_img: "../../images/plant/taochuangjiabing.jpg",
      diease_zhengzhuang: '果实被害多在顶部发病，受害仅在果皮部分，病部初生暗绿色圆斑，并逐渐扩大成紫黑色或红褐色病斑，稍凹陷，上面着生黑色霉层。随着病部木栓化和果实膨大，病部常龟裂或畸形。 枝条被害处先出现浅褐色圆斑，边缘紫褐色，后变黑褐色，稍隆起，常有流胶现象发生。叶片被害，初生多角形或不规则灰绿色病斑，逐渐扩大后变成褐色或紫红色，最后病部干枯脱落成穿孔。',
      diease_fangan: '1、加强栽培管理，提高树体抗病力，增施有机肥，控制速效氮肥的用量，适量补充微量元素肥料，以提高树体抵抗力。合理修剪，注意桃园通风透光和排水。2、清除菌源: 秋末冬初结合修剪，彻底清除园内树上的病枝、枯死枝、僵果、地面落果，集中处理，以减少初侵染源。3、及时防治害虫: 及时喷药防治害虫，减少虫伤，以减少病菌侵入的机会。 ①在芽萌动前结合清园工作，用靓果安800倍液+适量渗透剂如有机硅，喷干枝，消灭越冬菌源。②套袋前后可选用靓果安500-600倍液或速净500-600倍等药剂交替使用。 ③病情严重使用奥力克靓果安600倍液或奥力克速净600倍+戊唑醇4000倍或纯品甲托1500倍，进行喷施。'
}, ]
},

/**
* 生命周期函数--监听页面加载
*/
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})