// pages/diease/tudou.js
Page({

  /**
   * 页面的初始数据
   */
  data: {


    data_diease: [{
      diease: "马铃薯",
      diease_name: '早疫病',
      diease_bingyin: ' 马铃薯早疫病是真菌性病害，由半知菌亚门中的称为茄链格孢（Alternaria solani（Ellis et Martin）Jones et Grout）的真菌引起。主要危害叶片、茎。叶片受害产生圆形或近圆形黑褐色病斑，病斑具有同心轮纹，大小3～4 mm，湿度大时，病斑上产生黑色霉层，发病严重时叶片干枯脱落，致使田间叶片枯焦。块茎染病，病斑黑褐色或暗褐色、圆形或近圆形、病部稍凹陷，边缘分明，皮下呈浅褐色海绵状干腐。',
      diease_img: "../../images/plant/tudouzaoyibing.jpg",
      diease_zhengzhuang: '本病主要为害叶片，亦可侵害块茎。初发病时，叶片上产生一些零星的褐色小斑点，后病斑逐渐扩大，呈不规则形，上面有同心轮纹。病斑周围有狭窄的退色环晕。发病严重时，植株的叶片由下而上逐渐干枯脱落，只有顶部少数几片叶子仍保持绿色。块茎染病可产生凹陷的圆形病斑，病健部边缘分明，皮下呈浅褐色海绵状干腐',
      diease_fangan: ' (1)选种：选种早熟耐病品种，适当提早收获。(2)选地：选择在土壤肥沃、地势高的地方种植。(3)施肥：增施有机肥料，增施磷、钾肥，提高植株抗病能力。(4)药剂防治：掌握在发病初期，每667平方米(1亩)用75％百菌清可湿性粉剂600倍液，64％杀毒矾可湿性粉剂500倍液，或用77％可杀得可湿性粉剂500倍液喷雾，每隔7～10天喷1次，连续喷2～3次。'
},{
      diease: "马铃薯",
        diease_name: '晚疫病',
        diease_bingyin: 'Phytophthora infestans (Mont.)de Bary称致病疫霉属鞭毛茵亚门真菌。孢囊梗分枝，每隔一段着生孢子囊处具膨大的节。孢子囊柠檬形，大小2～38×12～23（um），一端具乳突，另端有小柄，易脱落，在水中释放出5～9个肾形游动孢子。游动孢子具鞭毛2根，失去鞭毛后变成休止孢子，萌发出芽管，又生穿透钉侵入到寄主体内。菌丝生长适温20～23℃，孢子囊形成适温19～22℃，10～13℃形成游动孢子，温度高于24℃，孢子囊多直接萌发，孢子囊形成要求相对湿度高。',
        diease_img: "../../images/plant/malingshuwanyibing.jpg",
        diease_zhengzhuang: ' 本病主要为害叶片，亦可侵害块茎。初发病时，叶片上产生一些零星的褐色小斑点，后病斑逐渐扩大，呈不规则形，上面有同心轮纹。病斑周围有狭窄的退色环晕。发病严重时，植株的叶片由下而上逐渐干枯脱落，只有顶部少数几片叶子仍保持绿色。块茎染病可产生凹陷的圆形病斑，病健部边缘分明，皮下呈浅褐色海绵状干腐。' ,
      diease_fangan: ' (1)选种：选种早熟耐病品种，适当提早收获。(2)选地：选择在土壤肥沃、地势高的地方种植。(3)施肥：增施有机肥料，增施磷、钾肥，提高植株抗病能力。(4)药剂防治：掌握在发病初期，每667平方米(1亩)用75％百菌清可湿性粉剂600倍液，64％杀毒矾可湿性粉剂500倍液，或用77％可杀得可湿性粉剂500倍液喷雾，每隔7～10天喷1次，连续喷2～3次。'
},]

},

/**
* 生命周期函数--监听页面加载
*/
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})