// pages/diease/yingtao.js
Page({

  /**
   * 页面的初始数据
   */
  data: {

    data_diease: [{
      diease: "樱桃",
      diease_name: '白粉病',
      diease_bingyin: '  病菌主要在冬季生产番茄上越冬，也可在其他寄主上越冬。越冬病菌通过气流传播形成初侵染，发病后产生分生孢子进行重复侵染，使病害扩展蔓延。温暖潮湿有利于发病，病菌生长适宜温度20一25℃，适宜湿度80％左右，湿度较低也可发病。一般田间荫蔽、昼暖夜凉、结露多病害较重，樱桃番茄生长中后期管理不善，植株生长衰弱、空气较干燥病害仍可发生蔓延。',
      diease_img: "../../images/plant/yingtaobaifenbing.jpg",
      diease_zhengzhuang: ' 此病常在生长中后期发生，由中下部叶向上发展。初在叶片上形成零星白色小粉斑，以后形成较明显大小不等的粉状斑，相互汇合致整叶布满白粉，随病斑增加早期染病部位的叶肉组织逐渐褪绿，最后坏死。严重时叶正背面均覆满病斑，终致叶片萎黄，全株枯死。',
      diease_fangan: '1．彻底清除病残体和田间杂草，尤其是蓼科杂草，减少初侵染菌源。  2．增施有机底肥，中后期适时追肥，避免早衰，零星发病时及时摘除病叶。 3．发病初期选用农抗120或武夷菌素200―300倍液，或40％福星(新星)乳油8000倍液，或2％加收米水剂600倍液，或50％硫磺悬浮剂400倍液，或30％特富灵可湿性粉剂4000倍液，或15％粉锈宁可湿性粉剂l000一l500倍液喷雾。保护地种植，发病初期选用5％百菌清粉尘剂或5％加瑞农粉尘剂，或上述喷雾药剂的粉尘剂15千克／公顷喷粉，防治效果理想。'
    },]



  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})